{
    "hello": "Hello! How may I assist you today?",
    "goodbye": "Farewell! Wishing you a great day ahead!",
    "account types": "We offer Savings, Current, Fixed Deposit, and Business Accounts.",
    "loan types": "Available loans include Home, Personal, Auto, and Education Loans.",
    "interest rates": "Interest rates vary: Savings (2%-5%), Loans depend on type and tenure.",
    "atm locations": "ATMs are available in Colombo, Kandy, Galle, and Jaffna.",
    "how to apply for a loan": "Apply online via our website or visit any branch.",
    "banking hours": "Our hours are 9 AM to 4 PM, Monday to Friday.",
    "contact support": "Call 123-456-789 or email support@ourbank.com.",
    "branch locations": "Branches in Colombo, Kandy, Galle, and Jaffna.",
    "fees": "Fees vary by account type. Contact support for exact details.",
    "question": "answer",
    "me": "you",
    "types of bank accounts": "the main types of bank accounts include savings account, current account, and fixed deposit account.",
    "savings account": "a savings account is used to deposit money safely while earning interest over time.",
    "current account": "a current account is ideal for frequent transactions and is commonly used by businesses.",
    "fixed deposit": "a fixed deposit is a savings scheme where money is locked for a fixed period at a higher interest rate.",
    "minimum balance": "most banks require a minimum balance in savings or current accounts to avoid penalties.",
    "bank interest rate": "the interest rate varies depending on the type of account or loan. it is announced by the central bank and individual banks.",
    "atm withdrawal limit": "the atm withdrawal limit depends on the bank and the type of card you hold.",
    "online banking": "online banking allows you to access your account, transfer funds, and pay bills through the internet.",
    "mobile banking": "mobile banking lets you manage your bank account using a smartphone app provided by your bank.",
    "documents for account opening": "to open a bank account, you typically need a valid id, proof of address, and passport-size photos.",
    "debit card": "a debit card allows you to make purchases and withdraw money directly from your bank account.",
    "credit card": "a credit card allows you to borrow money from the bank up to a certain limit and pay it back later with interest if not paid in full.",
    "types of loans": "banks offer various loans such as personal loans, home loans, education loans, and vehicle loans.",
    "bank statement": "a bank statement is a record of all transactions in your account for a specific period.",
    "bank working hours": "most banks operate from 9 am to 3 pm on weekdays, with limited hours on saturdays.",
    "personal loan": "a personal loan is an unsecured loan that you can use for various purposes like education, medical expenses, or travel.",
    "home loan": "a home loan helps you borrow money from a bank to purchase, build, or renovate a house.",
    "education loan": "an education loan is designed to cover tuition and related expenses for students pursuing higher education.",
    "vehicle loan": "a vehicle loan helps you buy a car or bike by repaying in monthly installments over a fixed period.",
    "recurring deposit": "a recurring deposit allows you to save a fixed amount monthly for a specific period, earning interest on it.",
    "two-factor authentication": "two-factor authentication adds an extra layer of security using a code or app in addition to your password.",
    "upi transactions": "upi is a real-time payment system in india that allows instant money transfers between bank accounts using a mobile number or upi id.",
    "phishing scams": "phishing is a fraud attempt where attackers trick users into revealing sensitive information through fake emails or websites.",
    "block card": "if your card is lost or stolen, contact your bank immediately to block it and prevent unauthorized transactions.",
    "safe online banking": "always use strong passwords, avoid public wi-fi, and monitor your accounts regularly for suspicious activity.",
    "kyc process": "kyc stands for know your customer and involves verifying identity and address before opening an account.",
    "bank charges": "banks may apply charges for services like atm withdrawals, sms alerts, or account maintenance. check your bank's policy.",
    "dormant account": "an account becomes dormant if there are no transactions for a specific period, usually 1-2 years.",
    "account nominee": "a nominee is a person chosen to receive the funds in your account in case of your death.",
    "account closure": "to close a bank account, you must fill a closure form, submit id proof, and return unused cheques or cards.",
    "bank helpline": "most banks provide a 24/7 customer helpline for account queries, card issues, or fraud reporting.",
    "dispute a transaction": "if you notice an incorrect charge, report it to your bank immediately for investigation and resolution.",
    "update contact details": "you can update your phone number or email by visiting your branch or through online banking.",
    "mutual funds": "a mutual fund is a pool of money collected from investors to invest in stocks, bonds, or other assets, managed by professionals.",
    "fixed deposits": "fixed deposits are time-bound savings that earn a guaranteed interest rate over a fixed period.",
    "stock trading": "stock trading involves buying and selling shares of companies through a stock exchange to earn profits or dividends.",
    "bonds": "bonds are loans you give to a company or government, and in return, you get fixed interest over time.",
    "portfolio management": "portfolio management involves choosing and managing a mix of investment assets to meet specific financial goals.",
    "samurdhi banking scheme": "the samurdhi program in sri lanka provides financial support and microfinance services to low-income families.",
    "nsb savings certificates": "nsb offers savings certificates with guaranteed returns, popular for safe long-term investment in sri lanka.",
    "senior citizens savings scheme": "special savings accounts offer higher interest rates and benefits for senior citizens.",
    "agricultural loans": "banks offer low-interest loans to farmers to support crop production, equipment purchase, and irrigation.",
    "foreign currency account": "this account allows you to hold and manage funds in international currencies like usd, eur, or gbp.",
    "exchange rate": "the exchange rate is the value of one currency in terms of another, which changes based on global markets.",
    "swift code": "a swift code is a unique identifier used in international banking to ensure accurate and secure money transfers.",
    "international money transfer": "you can send money abroad through services like wire transfer or remittance platforms.",
    "foreign remittance": "a foreign remittance is money sent to your home country by someone working abroad, often used to support families.",
    "chatbot banking": "chatbots in banking help customers with queries, transactions, and services using automated conversation.",
    "qr code payments": "qr payments allow you to scan a code using a banking app to pay instantly, often without cash or cards.",
    "biometric authentication": "this method uses fingerprint, facial recognition, or voice to verify a user's identity for secure access.",
    "green banking": "green banking supports environmentally friendly practices like digital statements, paperless banking, and eco-loans.",
    "good morning": "good morning! hope you have a great day ahead.",
    "good afternoon": "good afternoon! how can i assist you today?",
    "good evening": "good evening! how may i help you?",
    "hi": "hi there! what can i do for you?",
    "hey": "hey! need any help?",
    "how are you": "i'm smart banking assistant , i'm ready to help you!",
    "what’s up": "not much!  here to help you out.",
    "good night": "good night! feel free to message anytime.",
    "thank you": "you're welcome! let me know if you need anything else.",
    "thanks": "no problem! happy to help.",
    "thanks a lot": "you’re most welcome!",
    "thank you very much": "anytime! i’m here to assist.",
    "good bye": "goodbye! take care.",
    "bye": "bye! have a great day.",
    "see you later": "see you soon!",
    "talk to you later": "looking forward to it!",
    "have a nice day": "you too! enjoy your day.",
    "take care": "you as well! stay safe.",
    "who are you": "i'm your virtual assistant here to help you!",
    "what can you do": "i can provide information, answer questions, and guide you.",
    "where are you from": "i'm based in the cloud but always close by to help.",
    "are you a human": "i'm not human, but i'm smart enough to assist you!",
    "do you sleep": "i’m always awake and ready to help.",
    "are you real": "as real as helpful can be!",
    "what are the types of accounts": "we offer savings, current, fixed deposit, and business accounts for different customer needs.",
    "what is mobile banking": "mobile banking allows you to securely access and manage your bank accounts through a mobile app anytime, anywhere.",
    "how do i open a joint account": "to open a joint account, both account holders must visit the branch with valid ids, proof of address, and complete a joint account application form.",
    "where is the nearest atm": "you can find the nearest atm using our website atm locator tool or by contacting our customer support."
   
}